{"sections":{"main":{"type":"page","disabled":true,"settings":{}},"164580708771f5654a":{"type":"dynamic-slideshow","blocks":{"164580708765de66e2-1":{"type":"slide","settings":{"background_image":"shopify:\/\/shop_images\/sportsmens-1400x788-1.jpg","title":"OUR BRANDS","text":"Have a look","color":"#ffffff","link":"","text_alignment":"center","button_one_label":"","button_one_link":"","button_one_style":"primary","button_two_label":"","button_two_link":"","button_two_style":"primary","show_overlay":true,"overlay_color":"#000000","overlay_opacity":50}}},"block_order":["164580708765de66e2-1"],"settings":{"enable_autoplay":true,"autoplay_duration":8,"slideshow_width":"full","slideshow_height":"medium","slideshow_height_mobile":"medium","slideshow_text_below_image":true}},"1645807225d8a7c9a5":{"type":"dynamic-image-with-text","settings":{"section_heading":"","image":"shopify:\/\/shop_images\/gggg_5406dc45-cc60-445a-98c9-753a76384328.png","crop":"center","desktop_height":"natural","mobile_height":"natural","desktop_image_alignment":"left","mobile_image_alignment":"top","heading":"QUALITY","subheading":"<p><strong>Givova<\/strong> is one of the fastest growing international soccer brands.  Professional teams around the world wear <strong>Givova<\/strong>, as do national programs such as Malta Football, Iran Football Federation and the Serbian Olympic Team.  This is why Australian teams from NPL level through to community clubs are choosing Givova <\/p><p>Today Givova has an integrated logistics platform of over 30,000m2 which is perfectly organized for the distribution of its products throughout the world. Givova evaluates the market demand offering flexibility and fast responses to the needs of the industry with an obsessive attention to details, textiles and style, so that its products not only suit the taste of the customers, but also follow the trends in sports fashion.<\/p><p>One huge advantage of working with a company like Givova, is accessing their buying power. Givova worldwide distributes to more than 25 countries and due to this volume, we at Givova Australia can take advantage of the wholesale prices, a company of this size can offer.<\/p><p>We have already partnered with a number of high profile football clubs around the country as well as saving money for the community clubs of Australia.<\/p><p>Discover why <strong>GIVOVA<\/strong> is #1 in Italy, outselling all other major brands.  Discover why this trend is sweeping through Europe, now arriving at the shores of AUSTRALIA.<em><strong>Italian fashion.  Italian quality.Global performance.<\/strong><\/em><\/p>","text_alignment":"left","button_label":"Button","button_link":""}},"1645807308cdad6343":{"type":"dynamic-image-with-text","settings":{"section_heading":"","image":"shopify:\/\/shop_images\/zeus-logo.png","crop":"center","desktop_height":"natural","mobile_height":"natural","desktop_image_alignment":"left","mobile_image_alignment":"top","heading":"","subheading":"<p><strong>1.HistorY<\/strong><\/p><p>In 1999 the Zeus Sport began his great adventure in the world of sports.<br\/>The company is the brainchild of a group of enterprising young people and especially to achieve ambitious objectives projects including the promotion of the brand nationally and internationally. For this purpose, the Zeus Sport offers the general public by focusing on service and customer care, by creating a team of competent and motivated.<br\/>It has helped over the years to project activities in three directions: the extension of markets, development of products and the internal organization.<br\/>A strategy based on interpreting the market well, its needs and the ability to transform ideas into organized products.<\/p><p><\/p><p><strong>2.The Structure<\/strong><\/p><p>The Zeus Sport has large and modern facilities of approximately 20,000 square meters, each part of the company cooperates smoothly and efficiently, based on a collaborative spirit that makes Zeus Sport a winning team.<br\/>The wide open spaces of storage and organization enable the regular course of business.<\/p><p><\/p><p><strong>3.OBJECTIVES AND PHILOSOPHY<\/strong><\/p><p>Make every sportman a divinity that is the meaning of the pay-off “ZEUS WEAR THE DIVINITY”.<br\/>The main goal, of the Zeus Sport is to become more marked in the sports world, through its main features that correspond with the correct habits of the real life:<\/p><p><strong>TO BE SIMPLE, TO BE SERIOUS, TO BE PROFESSIONAL AND TO BE WILLING<\/strong><br\/>The sport has become increasingly importance also from a social point of view, economically and politically, becoming an integral part of the culture of a society and its development in harmony with the changes that mark. For these reasons the Zeus Sport aims to the world of sports as a dynamic company that is ever sensitive to these continual progress.<\/p>","text_alignment":"left","button_label":"Button","button_link":""}},"164580737365441b98":{"type":"dynamic-image-with-text","settings":{"section_heading":"","image":"shopify:\/\/shop_images\/jjj.jpg","crop":"center","desktop_height":"natural","mobile_height":"natural","desktop_image_alignment":"left","mobile_image_alignment":"top","heading":"","subheading":"<p>Jemsz is a young, energetic company that combines healthy ambition with an honest commercial policy. Affordable top quality and an impeccable client service are our biggest priorities. We are a worldwide distributor of professional sportswear. Our wide collection is available in many colours, and stay in fashion for multiple years. We always look for the best material for all different kinds of products. Our clothing is tested very thoroughly and meets all quality standards, without our customers paying extra. Interested in Jemsz?<\/p>","text_alignment":"left","button_label":"","button_link":""}}},"order":["main","164580708771f5654a","1645807225d8a7c9a5","1645807308cdad6343","164580737365441b98"]}